# FloorAttrDefaultHeightParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FloorAttrDefaultHeightParam Property
ParameterTypeId Class See Also
---
"Default Height above level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FloorAttrDefaultHeightParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorAttrDefaultHeightParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FloorAttrDefaultHeightParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace